* DONE <2020-06-05 Fri> vst
  Some notes from IPlugControls-vst3.vcxproj.filters
  #+BEGIN_EXAMPLE
      <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstaudioeffect.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstbus.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstcomponent.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstcomponentbase.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstinitiids.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstparameters.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\vst\vstsinglecomponenteffect.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\source\vst</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\common\pluginview.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\common</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\common\memorystream.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\common</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\main\dllmain.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\main</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\baseiids.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\fbuffer.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\fdebug.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\fdynlib.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\fobject.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\fstreamer.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\fstring.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\timer.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\source\updatehandler.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\source</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\thread\source\flock.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\thread</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\base\thread\source\fcondition.cpp">
      <Filter>IPlug\VST3\VST3_SDK\base\thread</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\pluginterfaces\base\conststringtable.cpp">
      <Filter>IPlug\VST3\VST3_SDK\plugininterfaces\base</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\pluginterfaces\base\coreiids.cpp">
      <Filter>IPlug\VST3\VST3_SDK\plugininterfaces\base</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\pluginterfaces\base\funknown.cpp">
      <Filter>IPlug\VST3\VST3_SDK\plugininterfaces\base</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\pluginterfaces\base\ustring.cpp">
      <Filter>IPlug\VST3\VST3_SDK\plugininterfaces\base</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\main\pluginfactory.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\main</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\IPlug\IPlugPaths.cpp">
      <Filter>IPlug</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\IPlug\VST3\IPlugVST3.cpp">
      <Filter>IPlug\VST3</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\IPlug\VST3\IPlugVST3_ProcessorBase.cpp">
      <Filter>IPlug\VST3</Filter>
    </ClCompile>
    <ClCompile Include="..\..\..\Dependencies\IPlug\VST3_SDK\public.sdk\source\common\commoniids.cpp">
      <Filter>IPlug\VST3\VST3_SDK\public.sdk\common</Filter>
    </ClCompile>

  #+END_EXAMPLE

  so, folders of interest
  - Dependencies\IPlug\VST3_SDK\public.sdk\source\vst
  - Dependencies\IPlug\VST3_SDK\public.sdk\source\common
  - Dependencies\IPlug\VST3_SDK\public.sdk\source\main
    dllmain.cpp
  - Dependencies\IPlug\VST3_SDK\base\source
  - Dependencies\IPlug\VST3_SDK\pluginterfaces\base
  - IPlug\VST3
    only headers?
  - IPlug\VST3\VST3_SDK
  - IPlug\APP
    should NOT be included in vst build


  directories in iPlug
  #+BEGIN_SRC sh
ls subprojects/iPlug2/IPlug/*/ -d
  #+END_SRC

  #+RESULTS:
  | subprojects/iPlug2/IPlug/AAX/       |
  | subprojects/iPlug2/IPlug/APP/       |
  | subprojects/iPlug2/IPlug/AUv2/      |
  | subprojects/iPlug2/IPlug/AUv3/      |
  | subprojects/iPlug2/IPlug/Extras/    |
  | subprojects/iPlug2/IPlug/ReaperExt/ |
  | subprojects/iPlug2/IPlug/VST2/      |
  | subprojects/iPlug2/IPlug/VST3/      |
  | subprojects/iPlug2/IPlug/WEB/       |

  so, let's add an option called target

